Repository: acolomb/elf-mangle
Catalog: po/*.po
Languages: de

source: Prototype system
de: Protoypsystem

source: Production system
de: Produktionssystem

source: invalid hardware
de: ungültige Hardware

source: unknown hardware
de: unbekannte Hardware

source: (%zu of %<PRIu8> bytes missing)
de: (%zu von %<PRIu8> Byte fehlen)

source: (%<PRIu8> bytes)
de: (%<PRIu8> Byte)

source: missing NUL termination!
de: kein NUL-Terminator!

source: (%<PRIu8> unprintable bytes replaced by %c)
de: (%<PRIu8> nicht druckbare Zeichen durch %c ersetzt)

source: <unknown version> (%<PRIu8> bytes)
de: <unbekannte Version> (%<PRIu8> Byte)

source: WARNING: %s changed to match target hardware type! %02<PRIu8> (%s) in target map %02<PRIu8> (%s) provided from image
de: ACHTUNG: Feld %s auf Hardwaretyp angepasst! %02<PRIu8> (%s) in Zielobjekt %02<PRIu8> (%s) aus Abbild gelesen

source: Unique system identification
de: Eindeutige Systemkennung

source: System firmware version
de: Firmwareversion des Systems

source: NUMBER
de: NUMMER

source: Override system serial number in output
de: System-Seriennummer in Ausgabe überschreiben

source: Skip CRC update post-processor
de: Anpassung der Prüfsumme in Post-Prozessor überspringen

source: Invalid serial number `%s' specified.
de: Ungültige Seriennummer '%s' angegeben.

source: Example-specific options:
de: Optionen spezifisch für Beispiel:

source: Checksum field %s not found in map.
de: Prüfsummenfeld %s nicht in der Zielzuordnung gefunden.

source: Checksum field %s has %zu bytes, expected %zu.
de: Prüfsummenfeld %s hat %zu Bytes, %zu erwartet.

source: CORRECT checksum %08<PRIX32> in field %s.
de: KORREKTE Prüfsumme %08<PRIX32> im Feld %s.

source: WRONG checksum %08<PRIX32> in field %s, expected %08<PRIX32>.
de: KORREKTE Prüfsumme %08<PRIX32> im Feld %s, %08<PRIX32> erwartet.

source: Failed to update checksum field %s to %08<PRIX32>.
de: Fehler beim Aktualisieren des Prüfsummenfelds %s auf %08<PRIX32>.

source: Updated checksum field %s to %08<PRIX32>.
de: Prüfsummenfeld %s auf %08<PRIX32> aktualisiert.

source: Missing %zu of %zu data bytes!
de: %zu von %zu Datenbytes fehlen!

source: Length prefixed string at offset [%04zx] (%zu bytes + NUL): "%s"
de: Zeichenkette mit Längenpräfix an Position [%04zx] (%zu Byte + NUL): "%s"

source: Image file "%s" is not in Intel Hex format, trying raw binary.
de: Abbilddatei "%s" ist nicht im Intel-Hex-Format, versuche Binärformat.

source: Invalid input image file format.
de: Ungültiges Format für Binärabbild.

source: %s: Output file "%s" format %d
de: %s: Ausgabedatei "%s" im Format %d

source: Invalid output image file format specified.
de: Ungültiges Ausgabeformat für Binärabbild.

source: Cannot open image "%s" (%s)
de: Abbilddatei "%s" kann nicht geöffnet werden (%s)

source: Could not determine data range in Intel Hex file "%s" (%s)
de: Konnte Datenbereich in der Intel-Hex-Datei "%s" nicht ermitteln (%s)

source: Image file "%s" is empty
de: Abbilddatei "%s" ist leer

source: %s: %s contains range 0x%04<PRIx32> to 0x%04<PRIx32>
de: %s: %s umfasst den Bereich 0x%04<PRIx32> bis 0x%04<PRIx32>

source: Could not allocate memory for image data: %s
de: Konnte keinen Speicher für Abbilddaten zuweisen: %s

source: Could not copy data from Intel Hex file "%s" (%s)
de: Konnte keine Daten aus der Intel-Hex-Datei "%s" kopieren (%s)

source: Image file "%s" is too small, %zu of %zu bytes missing
de: Abbilddatei "%s" ist zu klein, %zu von %zu Byte fehlen

source: %s: Record len=%zu source=%p rest=%zu USBA=%<PRIu32>
de: %s: Eintrag len=%zu source=%p rest=%zu USBA=%<PRIu32>

source: Cannot open output image "%s" (%s)
de: Abbilddatei "%s" für Ausgabe kann nicht geöffnet werden (%s)

source: %s: copy %zu bytes from file offset %zu to %p
de: %s: Kopiere %zu Byte von Dateiposition %zu nach %p

source: Failed to read %s (%zu bytes) from file offset %zu to %p (%s)
de: Fehler beim Lesen von %s (%zu Byte) von Dateiposition %zu nach %p (%s)

source: Failed to read %zu bytes from file "%s" at offset %zu (%s)
de: Fehler beim Lesen von %zu Byte aus Datei "%s" von Position %zu (%s)

source: %s: mmap() failed (%s)
de: %s: mmap() fehlgeschlagen (%s)

source: Cannot resize image file "%s" to %zu bytes (%s)
de: Abbilddatei "%s" kann nicht auf %zu Bytes vergrößert werden (%s)

source: Cannot write image file "%s" (%s)
de: Abbilddatei "%s" kann nicht geschrieben werden (%s)

source: Input / output options:
de: Ein- / Ausgabeoptionen:

source: SECTION
de: SEKTION

source: Use SECTION from ELF file instead of the default (
de: Benutze SEKTION aus der ELF-Datei anstatt der Standardsektion (

source: FILE
de: DATEI

source: Read binary input data from image FILE
de: Lese Eingabe-Binärdaten aus der Abbild-DATEI

source: Format of input image file. FORMAT can be either "raw", "ihex" or "auto" (default)
de: Format der Eingabe-Abbilddatei. Unterstützte FORMATe: "raw", "ihex" oder "auto" (standard)

source: Write binary data to output image FILE
de: Binärdaten in Ausgabe-Abbilddatei DATEI schreiben

source: Format of output image file. FORMAT can be either "raw" or "ihex" (default)
de: Format der Ausgabe-Abbilddatei. Unterstützte FORMATe: "raw" oder "ihex" (standard)

source: FIELD=BYTES,...
de: FELD=BYTES,...

source: Override the given fields' values (comma-separated pairs). Each FIELD symbol name must be followed by an equal sign and the data BYTES encoded in hexadecimal. Missing bytes are left unchanged, extra data generates an error.
de: Werte der angegebenen Felder überschreiben (Paare durch Komma getrennt). Nach jedem Symbolnamen FELD muss ein Gleichzeichen und die Daten-BYTES in Hexadezimal-Kodierung stehen. Nicht spezifizierte Bytes bleiben unverändert, zu viele führen zum Fehler.

source: Read override field=value pairs from FILE. Like the --define option, but accepts pairs separated by comma or newlines. If FILE is -, the list will be read from standard input.
de: Werte überschreiben mittels Feld=Wert-Paaren aus DATEI. Wie die Option --define, aber Paare können durch Komma oder Zeilenumbruch getrennt sein. Wenn DATEI ein - (Bindestrich) ist, wird die Liste von der Standardeingabe gelesen.

source: Display information from parsed files:
de: Information aus analysierten Dateien auflisten:

source: Print field values. FORMAT can be either "pretty" (default), "pretty-only", "hex", or "defines"
de: Werte der Felder ausgeben. Unterstützte FORMATe: "pretty" (standard), "pretty-only", "hex", oder "defines"

source: Print symbol address for each field
de: Symboladresse für jedes Feld ausgeben

source: Show object symbol names instead of field decriptions
de: Symbolnamen anstatt Feldbeschreibungen anzeigen

source: Print size in bytes for each field
de: Größe in Byte für jedes Feld ausgeben

source: Print only symbols differing from output map
de: Nur Symbole mit geändertem Inhalt gegenüber der Ausgabezuordnung auflisten

source: Print size in bytes for the whole image
de: Größe in Byte für das gesamte Abbild ausgeben

source: MIN-LEN
de: ANZAHL

source: IN_MAP [OUT_MAP]
de: EINGABE_ELF [AUSGABE_ELF]

source: Analyze, transform and manipulate binary data based on ELF symbol tables.
de: Analyse, Umwandlung und Manipulation von Binärdaten anhand von ELF-Symboltabellen.

source: Invalid binary image format `%s' specified.
de: Ungültiges Format '%s' für Binärabbild angegeben.

source: Minimum string length %d out of range.
de: Minimale Zeichenkettenlänge %d außerhalb des gültigen Bereichs.

source: Unknown print format `%s' specified.
de: Unbekanntes Ausgabeformat '%s' angegeben.

source: Too many map file arguments.
de: Zu viele Dateien für Symbolzuordnung.

source: Missing file name.
de: Dateiname fehlt.

source: Print length in bytes for each string
de: Länge in Byte für jede Zeichenkette ausgeben

source: SEP
de: TRENNER

source: Separator between strings in output.
de: Trennzeichen für die Ausgabe der Zeichenketten.

source: Print the location of the string in base 8, 10 or 16 (default)
de: Fundstelle der Zeichenkette mit Basis 8, 10 oder 16 (standard) ausgeben

source: Locate length-prefixed strings of printable characters plus NUL terminator.
de: Suche Zeichenketten aus druckbaren Zeichen mit Längenangabe und NUL-Abschluss.

source: Invalid offset radix `%s' specified.
de: Ungültige Basis '%s' für Adressabstand angegeben.

source: Too many input file arguments.
de: Zu viele Dateien als Eingabe.

source: %s: Override directive truncated during append.
de: %s: Zuweisungsliste beim Anhängen abgeschnitten.

source: Could not append override directive "
de: Konnte Zuweisungsliste "

source: Failed after parsing %d hex bytes with `%s' remaining
de: Fehler nach %d verarbeiteten Hex-Byte, Restdaten: `%s'

source: %s: Missing symbol name in list member %d
de: %s: Symbolname fehlt im Listeneintrag %d

source: Could not parse byte data
de: Konnte Byte-Inhalte nicht parsen

source: Field not found
de: Feld nicht gefunden

source: Unable to parse override `%.*s' (%s)
de: Kann Zuweisung '%.*s' nicht parsen (%s)

source: Cannot open override file "%s" (%s)
de: Datei "%s" mit Überschreibungen kann nicht geöffnet werden (%s)

source: %zu bytes
de: %zu Byte

source: Could not access section header string table: %s
de: Kann nicht auf Sektions-Header-Stringtabelle zugreifen: %s

source: Header of ELF section %zu inaccessible: %s
de: Header der ELF-Sektion %zu unlesbar: %s

source: No ELF symbol table found
de: Keine ELF-Symboltabelle gefunden

source: No ELF section named '%s' found
de: Keine ELF-Sektion namens '%s' gefunden

source: Could not allocate image data: %s
de: Konnte keinen Speicher für Abbilddaten zuweisen: %s

source: Not an ELF object
de: Kein ELF-Objekt

source: Cannot open symbol map "%s" (%s)
de: Symbolzuordnung "%s" kann nicht geöffnet werden (%s)

source: No symbols found in ELF map section `%s'
de: Keine Symbole in ELF-Sektion `%s' gefunden

source: Error reading symbols from ELF map section `%s' (code %d)
de: Fehler beim Lesen der Symbole aus ELF-Sektion `%s' (Code %d)

source: Section image size: %zu bytes
de: Größe der Sektion: %zu Byte

source: %s: Target `%s' (%p) matches source symbol %p
de: %s: Ziel '%s' (%p) entspricht Symbol %p in Quelle

source: %s: %zu of %zu bytes copied
de: %s: %zu von %zu Byte kopiert

source: Target map field %s not found in source.
de: Feld %s der Zielzuordnung nicht in der Quelle gefunden.

source: %s: Copy %d symbols in to %d out
de: %s: Kopiere %d Quellsymbole auf %d Ziele
